rottenpotatoes/app/controllers/movies_controller.rb

  def find_with_same_director
    @movie = Movie.find(params[:id])
    if @movie.director != nil and @movie.director != ""
      @movies = Movie.find_movies_with_same_director(@movie.director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Lucas"]]